#+DATE: 2023-03-07

** Document Sigrok ~Demo~ device configuration keys

#+name: reset-modules
#+BEGIN_SRC python :eval no-export :results value :noweb no :session *Python* :exports no
# Document artefacts:
# 
# - Delete sigrokWrapper module from Python context so that changes
#   make take effect
#
# - Delete logging module from Python context so that we can reset
#   logging level
import sys
for m in [ 'logging', 'sigrokWrapper', ]:
    if m  in sys.modules:  
       print( f"delete module={m}")
       del sys.modules[m]
#+END_SRC

#+RESULTS: reset-modules


Using ~driveString~='demo'~ to access Sigrok demo device. In this example:
- create SigrokDriver using ~driveString~='demo'~
- open demo device for the ~SigrokDriver~ created
  - output device configuration keys
  - output device channel groups
  - for each channel group output configuration keys of the channel group

#+name: wrapper-doc
#+BEGIN_SRC python :eval no-export :results output :noweb no :session *Python* :var reset=reset-modules driverString="demo" :exports both
import sigrokWrapper

print( f"Create sigork wrapper using driverString='{driverString}'")
demo_drv  = sigrokWrapper.SigrokDriver(driver=driverString)
with demo_drv as demo_dev:  
    # Document string created
    print( f"Device {demo_dev}")
    print( f"   config_keys={demo_dev.config_keys()}")
    print( f"Channel-groups={demo_dev.channel_groups()}")
    for grp in demo_dev.channel_groups(): 
        print( f"  Channel -group {grp}: config_keys={demo_dev.config_keys(channel_group=grp)}")
    print( f"Channels={demo_dev.channels()}")
#+END_SRC

#+RESULTS: wrapper-doc
#+begin_example
Create sigork wrapper using driverString='demo'
Device , model :Demo device, version:  - 13 channels: D0, D1, D2, D3, D4, D5, D6, D7, A0, A1, A2, A3, A4
   config_keys=['CONTINUOUS', 'LIMIT_FRAMES', 'LIMIT_SAMPLES', 'LIMIT_MSEC', 'TRIGGER_MATCH', 'AVG_SAMPLES', 'AVERAGING', 'CAPTURE_RATIO', 'SAMPLERATE']
Channel-groups=['A0', 'A1', 'A2', 'A3', 'A4', 'Analog', 'Logic']
  Channel -group A0: config_keys=['OFFSET', 'MEASURED_QUANTITY', 'AMPLITUDE', 'PATTERN_MODE']
  Channel -group A1: config_keys=['OFFSET', 'MEASURED_QUANTITY', 'AMPLITUDE', 'PATTERN_MODE']
  Channel -group A2: config_keys=['OFFSET', 'MEASURED_QUANTITY', 'AMPLITUDE', 'PATTERN_MODE']
  Channel -group A3: config_keys=['OFFSET', 'MEASURED_QUANTITY', 'AMPLITUDE', 'PATTERN_MODE']
  Channel -group A4: config_keys=['OFFSET', 'MEASURED_QUANTITY', 'AMPLITUDE', 'PATTERN_MODE']
  Channel -group Analog: config_keys=['OFFSET', 'AMPLITUDE']
  Channel -group Logic: config_keys=['PATTERN_MODE']
Channels=['D0', 'D1', 'D2', 'D3', 'D4', 'D5', 'D6', 'D7', 'A0', 'A1', 'A2', 'A3', 'A4']
#+end_example

** Set RDTech DPS5020 ~enabled~ state

#+BEGIN_SRC python :eval no-export :results output :noweb no :session *Python* :var reset=reset-modules driverString="rdtech-dps:conn=/dev/ttyUSB0" :exports both
import sigrokWrapper

print( f"Create Sigork wrapper driver  using driverString='{driverString}'")
dps_drv = sigrokWrapper.SigrokDriver(driver=driverString)

with dps_drv as dev:
    status = dev.get('enabled')
    print( f"dev {dev} enabled {status}")
    time.sleep(1)
    dev.set( "enabled", not status )
    print( f"dev {dev} enabled {dev.get('enabled')}")
    
#+END_SRC

#+Results:
: Create Sigork wrapper driver  using driverString='rdtech-dps:conn=/dev/ttyUSB0'
: dev RDTech, model :DPS5020, version: v16 - 3 channels: V, I, P enabled True
: dev RDTech, model :DPS5020, version: v16 - 3 channels: V, I, P enabled False

** Ramp up RDTech DPS5020 voltage 

Define function ~ramp_up~, which steps up voltge from 0V to 5V in 1/STEP V increments.

#+name: ramp_up_module
#+BEGIN_SRC python :eval no-export :results output :noweb no :session *Python* :exports code
import sigrokWrapper
import time
from datetime import datetime

def ramp_up( drv, TARGET=5, STEP=5 ): 
   """
   Ramp up voltage from 0 to TARGET with number of STEPs

   :drv: sigrok
   
   :TARGET: target voltage

   :STEP:  time step 1/STEP s, voltage step TARGET/STEP V

   """

   # Ramp up voltage
   with dps_drv as dev: 

     # start from 0V
     dev.set( "enabled", False)
     dev.set( "voltage_target", 0.0)

     # let it settle
     time.sleep(1)

     dev.set( "enabled", True)
     for v in range (0,TARGET*STEP+1):
         voltage = v/STEP
         print( f"{datetime.now()}: voltage={voltage}")
         dev.set( "voltage_target", voltage)
         time.sleep(1/STEP)

     # Close output
     dev.set( "enabled", False)
     dev.set( "voltage_target", 0.0)
#+END_SRC

#+RESULTS: ramp_up_module


Call the function ~ramp_up~ function defined above to create voltage
ramp 0-5V.

#+BEGIN_SRC python :eval no-export :results output :noweb no :session *Python* :var reset=reset-modules  ramp_up_module=ramp_up_module  driverString="rdtech-dps:conn=/dev/ttyUSB0" :exports both

print( f"Using driverString='{driverString}'")
ramp_up(sigrokWrapper.SigrokDriver(driver=driverString))

#+END_SRC

#+RESULTS:
#+begin_example
Using driverString='rdtech-dps:conn=/dev/ttyUSB0'
2023-03-07 13:56:33.455057: voltage=0.0
2023-03-07 13:56:34.119487: voltage=0.2
2023-03-07 13:56:34.583753: voltage=0.4
2023-03-07 13:56:35.048099: voltage=0.6
2023-03-07 13:56:35.512535: voltage=0.8
2023-03-07 13:56:35.976632: voltage=1.0
2023-03-07 13:56:36.440767: voltage=1.2
2023-03-07 13:56:36.904845: voltage=1.4
2023-03-07 13:56:37.369555: voltage=1.6
2023-03-07 13:56:37.833419: voltage=1.8
2023-03-07 13:56:38.297698: voltage=2.0
2023-03-07 13:56:38.762092: voltage=2.2
2023-03-07 13:56:39.226353: voltage=2.4
2023-03-07 13:56:39.690723: voltage=2.6
2023-03-07 13:56:40.155514: voltage=2.8
2023-03-07 13:56:40.619328: voltage=3.0
2023-03-07 13:56:41.083750: voltage=3.2
2023-03-07 13:56:41.547862: voltage=3.4
2023-03-07 13:56:42.012490: voltage=3.6
2023-03-07 13:56:42.476458: voltage=3.8
2023-03-07 13:56:42.940868: voltage=4.0
2023-03-07 13:56:43.405043: voltage=4.2
2023-03-07 13:56:43.869375: voltage=4.4
2023-03-07 13:56:44.333244: voltage=4.6
2023-03-07 13:56:44.797901: voltage=4.8
2023-03-07 13:56:45.262222: voltage=5.0
#+end_example

** Ramp up RDTech DPS5020 voltage in a thread

Wrap function ~ramp_up~ into a Python thread to ramp up voltage from
0..3V with 0.25V  (1/4) increments.

#+BEGIN_SRC python :eval no-export :results output :noweb no :session *Python* :var reset=reset-modules ramp_up_module=ramp_up_module
from threading import Thread

dps_driver=sigrokWrapper.SigrokDriver(driver=driverString)
print( f"{datetime.now()} - main create thread t1")

t1 = Thread(target=ramp_up, kwargs={'drv':dps_driver, 'TARGET':3, 'STEP':4})

print( f"{datetime.now()} - main start thread t1")
t1.start()

print( f"{datetime.now()} - main join thread t1")
t1.join()
print( f"{datetime.now()} - main return from join thread t1")

#+END_SRC

#+RESULTS:
#+begin_example
2023-03-07 13:54:05.610069 - main create thread t1
2023-03-07 13:54:05.610221 - main start thread t1
2023-03-07 13:54:05.610574 - main join thread t1
2023-03-07 13:54:08.375299: voltage=0.0
2023-03-07 13:54:09.089735: voltage=0.25
2023-03-07 13:54:09.759203: voltage=0.5
2023-03-07 13:54:10.473189: voltage=0.75
2023-03-07 13:54:11.142815: voltage=1.0
2023-03-07 13:54:11.856900: voltage=1.25
2023-03-07 13:54:12.526750: voltage=1.5
2023-03-07 13:54:13.240729: voltage=1.75
2023-03-07 13:54:13.909973: voltage=2.0
2023-03-07 13:54:14.623952: voltage=2.25
2023-03-07 13:54:15.293809: voltage=2.5
2023-03-07 13:54:16.007700: voltage=2.75
2023-03-07 13:54:16.677083: voltage=3.0
2023-03-07 13:54:18.740140 - main return from join thread t1
#+end_example

*** Run two threads and collect data

#+BEGIN_SRC python :eval no-export :results output :noweb no :session *Python* :var reset=reset-modules :exports both
from threading import Thread
import time
from datetime import datetime

# Start logging
import logging
# logging.basicConfig(level=logging.INFO)
# logging.basicConfig(level=logging.DEBUG)
logging.info( f"{datetime.now()} - main - started")

# Driver strings
RIGOL="rigol-ds:conn=tcp-raw/192.168.120.56/5555"
DPS="rdtech-dps:conn=/dev/ttyUSB0"

import sigrokWrapper

dps_drv = sigrokWrapper.SigrokDriver(driver=DPS)
skooppi_drv = sigrokWrapper.SigrokDriver(driver=RIGOL)


# Collect data
data = {}

# Callback function 
def datafeed_in( device, packet ):
  logging.info( f"{datetime.now()} - datafeed_in - device={device.model}, packet type {packet.type} ")
  # print( f"{datetime.now()} - datafeed_in - device={device.model}, packet type {packet.type} ")
  sigrokWrapper.SigrokDriver.parsePacketData(packet=packet, data=data)
  logging.debug( f"{datetime.now()} - datafeed_in - { [ k + ':' + str(type(v)) for k,v in data.items()] }")


# setup scope
with skooppi_drv as skooppi_dev:
   # skooppi_dev.set( "probe_factor", 10, channel_group="CH1")
   # logging.info( f"{datetime.now()} - run_measurements -  before samplerate={skooppi_dev.get('samplerate')}")
   # skooppi_dev.set( "data_source", 'Memory')
   skooppi_dev.set( "data_source", 'Live')
   logging.info( f"{datetime.now()} - main -  {skooppi_dev.get('data_source')}")
   # Not supported
   # skooppi_dev.set( "samplerate", 10)
   # logging.info( f"{datetime.now()} - run_measurements after samplerate={skooppi_dev.get('samplerate')}")
   pass


# Create session object
logging.info( f"{datetime.now()} - run_measurements -  session_create")
sigrokWrapper.SigrokDriver.session_create()

# Define threds
t_drive = Thread(target=ramp_up, kwargs={'drv':dps_driver, 'TARGET':3, 'STEP':4})
t_measure = Thread(target=run_measurements, kwargs={'drv':skooppi_drv, 'callback': datafeed_in})

# Start threds
t_measure.start()
t_drive.start()

# Wait for driving thread (=dps ramp up) to finish
logging.info( f"{datetime.now()} - main - before join t_drive")
t_drive.join()
logging.info( f"{datetime.now()} - main - after join t_drive")

# Stop session = stops session in 't_measure' to quit
sigrokWrapper.SigrokDriver.session_stop()
logging.info( f"{datetime.now()} - main - before join t_measure")
t_measure.join()
logging.info( f"{datetime.now()} - main - after join t_measure")

# Cleanup
sigrokWrapper.SigrokDriver.session_close()
print( f"{datetime.now()} - datafeed_in - { [ k + ':' + str(len(v)) for k,v in data.items()] }")
# print( f"{datetime.now()} - datafeed_in - {data}")

#+END_SRC

#+RESULTS:
#+begin_example
2023-03-07 14:28:09.670026: voltage=0.0
2023-03-07 14:28:10.384463: voltage=0.25
2023-03-07 14:28:11.054365: voltage=0.5
2023-03-07 14:28:11.767942: voltage=0.75
2023-03-07 14:28:12.436947: voltage=1.0
2023-03-07 14:28:13.150911: voltage=1.25
2023-03-07 14:28:13.820645: voltage=1.5
2023-03-07 14:28:14.534535: voltage=1.75
2023-03-07 14:28:15.203756: voltage=2.0
sr: rigol-ds: Read should have been completed
2023-03-07 14:28:15.917670: voltage=2.25
2023-03-07 14:28:16.587132: voltage=2.5
2023-03-07 14:28:17.300769: voltage=2.75
2023-03-07 14:28:17.970699: voltage=3.0
2023-03-07 14:28:20.151616 - datafeed_in - ['CH1:1200']
#+end_example

** Module imports 

#+BEGIN_SRC python :eval no-export :results output :noweb no :session *Python* :tangle sigrokWrapper.py
import sigrok.core as sr
import sys
import time
from datetime import datetime
import logging
#+END_SRC

#+RESULTS:
: Python 3.9.16 | packaged by conda-forge | (main, Feb  1 2023, 21:39:03) 
: [GCC 11.3.0] on linux
: Type "help", "copyright", "credits" or "license" for more information.
: >>> python.el: native completion setup loaded

** class ~SigrokDriver~: session management

#+BEGIN_SRC python :eval no-export :results output :noweb no :session *Python* :tangle sigrokWrapper.py
  # ------------------------------------------------------------------
  # support with statement
  @staticmethod
  def session_create():
    if SigrokDriver.session is None:
        logging.info( "session created")
        SigrokDriver.session = SigrokDriver.context.create_session()
    return SigrokDriver.session

  @staticmethod
  def session_get():
    if SigrokDriver.session is None:
        raise ValueError( "session_get: Session missing - should have called 'session_create'")
    return SigrokDriver.session



  @staticmethod
  def session_add_device( device ):
      session = SigrokDriver.session_get()
      session.add_device(device.device)
      logging.info( f"added device {device.device}[{type(device.device)}] to session ")


  @staticmethod
  def session_start( fRun, fStop=lambda device,frame: print( "Stopped" )  ):
      session = SigrokDriver.session_get()
      logging.debug( f"session_start: called: is_running={session.is_running()}")
      if session.is_running():
          raise ValueError( f"Session was already running - not started")
      # def datafeed_in(device, packet):
      #     logging.info( f"datafeed_in: packet type {packet.type} ")
      #     logging.debug( f"datafeed_in: payload methods  {dir(packet.payload)} ")
      #     # print( f"device:{device.name}")
      # session.append( device, packet)

      # session.begin_save(outputFile)
      session.add_datafeed_callback(fRun)
      logging.debug( f"session_start: before start is_running={session.is_running()}" )
      session.start()
      logging.debug( f"session_start: after start is_running={session.is_running()}" )

  @staticmethod
  def session_run():
      """:return: False is already running, else True
      """
      session = SigrokDriver.session_get()
      logging.debug( f"session_run: called session is_running {session.is_running()}" )
      # if session.is_running(): 
      #     logging.info( f"session_run: session already running {session.is_running()} - nothing done" )
      #     return False
      logging.info( f"session_run: before session.run, is_running {session.is_running()}" )
      session.run()
      logging.info( f"session_run: after session.run, is_running {session.is_running()}" )
      return True


  @staticmethod
  def session_stop():
      session = SigrokDriver.session_get()
      session.stop()
      # SigrokDriver.session = None

  @staticmethod
  def session_close():
      SigrokDriver.session = None



#+END_SRC

#+RESULTS:
: Python 3.9.16 | packaged by conda-forge | (main, Feb  1 2023, 21:39:03) 
: [GCC 11.3.0] on linux
: Type "help", "copyright", "credits" or "license" for more information.
: Traceback (most recent call last):
:   File "<stdin>", line 1, in <module>
:   File "/tmp/babel-95GFUO/python-1WR9UQ", line 3
:     @staticmethod
: IndentationError: unexpected indent
: python.el: native completion setup loaded

** class ~SigrokDriver~: utilities for session callback functions

#+BEGIN_SRC python :eval no-export :results output :noweb no :session *Python* :tangle sigrokWrapper.py
  # ------------------------------------------------------------------
  # utilities to process callback data

  @classmethod
  def isAnalogPacket(cls, packet):
      return packet.type == sr.PacketType.ANALOG

  @classmethod
  def isLogicPacket(cls, packet):
      return packet.type == sr.PacketType.LOGIC

  @classmethod
  def packetChannels(cls, packet):
      return [ch.name for ch in packet.payload._channels() ]

  @classmethod
  def packetChannels(cls, packet):
      return [ch.name for ch in packet.payload._channels() ]

  @classmethod
  def parsePacketData(cls, packet, data):
      logging.info( f"parsePacketData: packet.type={packet.type}")
      if cls.isAnalogPacket(packet): 
          for i, channel in enumerate(cls.packetChannels(packet)):
              # previosly unseen channel?
              if channel not in data: data[channel] = []
              logging.info( f"parsePacketData: channel {channel} {len(packet.payload.data[i])}")
              data[channel].extend(packet.payload.data[i])
              # data[channel].append(packet.payload.data[i][-1])
      elif cls.isLogicPacket(packet): 
          channel = "logic"
          # if channel not in data: data[channel] = []
          # logging.info( f"parsePacketData: channel {channel} {len(packet.payload.data)}")
          # data[channel].extend(packet.payload.data)
          # TODO: collect also logic data (sepately?)
      return data


#+END_SRC

#+RESULTS:
: Traceback (most recent call last):
:   File "<stdin>", line 1, in <module>
:   File "/tmp/babel-b6I6LH/python-A8rxsi", line 4
:     @classmethod
: IndentationError: unexpected indent

** class ~SigrokDriver~: documentation string 

from device information:
#+BEGIN_SRC python :eval no-export :results output :noweb no :session *Python* :tangle sigrokWrapper.py
  # ------------------------------------------------------------------
  # print out
  def __str__(self):
    return str(self.device)
#+END_SRC


#+RESULTS:
: Python 3.9.16 | packaged by conda-forge | (main, Feb  1 2023, 21:39:03) 
: [GCC 11.3.0] on linux
: Type "help", "copyright", "credits" or "license" for more information.
: >>> python.el: native completion setup loaded

